# Физические константы
pl_water = 1000 # кг/м3 - плотность воды

# Табличные данные из СП
# Таблица № 17, коэффициент m
m_triang = [[45, 60, 75, 90, 120], [0.41, 0.47, 0.52, 0.58, 0.71]]
m_mnog = 0.83
m_sqad = 1

# Таблица № 18, коэффициент kb
kb_table = [[0.3, 1, 3, 10, 15, 25, 50], [5.5, 3.3, 2.2, 1.3, 1.1, 1, 0.5]]

# Таблица №19, коэффициент kv
kv_table = [[0.0000001, 0.00005, 0.0001, 0.0005, 0.001, 0.005, 0.01], [0.1, 0.9, 1, 1, 0.8, 0.5, 0.3]]

# Таблица №20, коэффициент k для протяжённых сооружений
k_table = [[0.3, 1, 3, 10, 20, 25], [1, 0.9, 0.8, 0.6, 0.5, 0.4]]